Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon.GetEdges Method
 Gets the edges of the area polygon.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetEdges()
Public Function GetEdges As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
The edges of the area polygon.
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace